Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Цветовая индикация портов
en: Color Indication of Ports

source: Цветовое кодирование и порядок кластеров совпадает с цветами и порядком выделения ячеек в Основной таблице.
en: Color coding and order of clusters matches the colors and selection order of cells in the Main table.

source: Целевой функцией для оптимизатора является среднеквадратическая ошибка на обучающем наборе.
en: The root-mean-square error of the training set is a target function for the optimizer.

source: Целое число >= 1 (по умолчанию = 10);
en: Integer >= 1 (by default = 10).

source: Целочисленный тип в диапазоне от 0 до 4 включительно:
en: Integer type in the range from 0 to 4 inclusive:

source: Целочисленный тип.
en: Integer type.

source: Целый, Вещественный
en: Integer, Real

source: Целый, вещественный
en: Integer, real

source: Целью при этом является оценка параметров распределения, которые максимизируют логарифмическую функцию правдоподобия, используемую в качестве меры качества модели.
en: The purpose is to assess distribution parameters that maximize logarithmic likelihood function used as the model quality measure.

source: Цикл по набору данных (групповая обработка) — аналог "FOR EACH".
en: Data set loop (group processing): analogue of "FOR EACH".

source: Цикл с постусловием — аналог "DO … WHILE …";
en: Post-test loop: analogue of "DO … WHILE …".

source: Цикл со счётчиком — аналог "FOR … TO …";
en: Counting loop: analogue of "FOR … TO …".

source: Циклические связи запрещены!
en: The cyclic links are forbidden!

source: Цифр (не может быть первым символом).
en: Digits (it cannot be the first character).

source: Частично закрытый (доступен только внутри текущего Модуля и его Подмоделей);
en: Partially private (available only in the current Module and its Supernodes);

source: Частными случаями являются модели LASSO L1 = 0 и Ridge регрессии L2 = 0.
en: LASSO L1 = 0 and Ridge of L2 = 0 regression are the models that represent special cases.

source: Частые наборы
en: Frequent Itemsets

source: Часть общих настроек (Повернуть на 90° – повернуть график, Нормировать, Навигатор, Анимация) вынесена на панель инструментов.
en: A part of general settings (Rotate 90° – rotate the chart, Rationing, Navigator, Animation) is available on the toolbar.

source: Часть полей исходного набора остается без изменений, образуя строки сводной таблицы;
en: A part of fields of the source data set is unchanged forming the strings of the pivot table.

source: Часы - часы в виде числа,
en: Hours - hours in the form of a number.

source: Чаще всего в качестве такого узла выступает Подмодель, поскольку в ней пользователь имеет возможность реализовать произвольную логику и задать структуру входных и выходных данных, создавая и настраивая ее порты.
en: Most frequently, the Supernode is used as such node, because a user can implement the random logics in it and set the structure of the input and output data creating and configuring its ports.

source: Чаще всего для создания производного компонента используется Подмодель.
en: The supernode is most commonly used to create the derived component.

source: Чаще всего таким узлом является подмодель, поскольку в ней возможно реализовать произвольную логику обработки.
en: Most frequently, such node is a supernode, as it is possible to implement the random processing logics in it.

source: Чек №000001
en: Check No 000001

source: Чек №000002
en: Check No 000002

source: Чек №000003
en: Check No 000003

source: Чем больше коэффициент, тем ниже уровень сходства и тем больше кластеров будет сгенерировано.
en: The higher coefficient, the lower the similarity level and the more clusters will be generated.

source: Чем больше порог разделения, тем больше кластеров будет сгенерировано при кластеризации.
en: The higher splitting significance threshold, the more clusters will be generated while clustering.

source: Чем больше эта зависимость, тем сильнее будет влияние одного входного параметра на другие.
en: The higher this dependence, the stronger impact exerts one input parameter on the other ones.

source: Через контекстное меню "Переместить в Переменные";
en: Using the contex menu - "Move to Variables".

source: Через него можно скрыть/отобразить столбец, а также зафиксировать или снять фиксацию со столбца.
en: It enables to hide/display the column and also fix the column or remove such fixing.

source: Число степеней свободы модели (ModelDF)
en: Number of the model degrees of freedom (ModelDF)

source: Число кластеров.
en: Number of clusters.

source: Число независимо варьируемых значений признака
en: Number of independently varied values of indicator

source: Число примеров, используемое в модели
en: Number of the samples used in the model

source: Число примеров, на котором обучается модель
en: Number of the samples which are used for the model training

source: Число степеней свободы остатков (ResDF)
en: Number of the residues degrees of freedom (ResDF)

source: Число столбцов равно числу входных полей узла Конечные классы.
en: The column count is equal to the input fields number of the Coarse Classes node.

source: Число сформированных классов может оказаться меньше заданного значения из-за ограничения по весу классов.
en: The count of generated classes can be less than the set value due to the class weight restriction.

source: Читинская обл.
en: The Chita Region

source: Чт
en: Thursday

source: Чтобы вернуться к исходному масштабу диаграммы, нужно воспользоваться — сбросить приближение.
en: To return to the initial chart scale, it is required to use reset zoom.

source: Чтобы включить ключевые поля присоединяемой таблицы в результирующий набор данных, необходимо установить флаг Добавлять присоединяемые ключевые поля.
en: To include the key fields of the joined table into the resulting data set, it is required to select the following checkbox: Add joined key fields.

source: Чтобы восстановить форматы по умолчанию, необходимо нажать кнопку Восстановить формат для всех полей.
en: To restore the default formats, it is required to press Restore format of all fields button.

source: Чтобы восстановить ширину полей по умолчанию, необходимо нажать кнопку Восстановить ширину всех полей.
en: To restore the default width of fields, it is required to press Restore width of all fields button.

source: Чтобы выбрать другие функции агрегации, необходимо дважды кликнуть по полю.
en: To select other aggregation functions, it is required to double click on the field.

source: Чтобы детальнее рассмотреть диаграмму при заданном увеличении, необходимо сделать активным режим перетаскивания.
en: To provide more detailed view of the chart with the set zooming in, it is required to enable the drag mode.

source: Чтобы его открыть, нужно дважды кликнуть по полю в списке Параметры или вызвать это окно из контекстного меню.
en: To open it, it is required to double click on the field in the Parameters list, or to call this window from the context menu.

source: Чтобы запустить его, необходимо нажать кнопку Применить фильтр.
en: To start it, it is required to press Apply filter button.

source: Чтобы изменить оператор, необходимо кликнуть по нему левой кнопкой мыши.
en: To change the operator, it is required to left-click on it.

source: Чтобы изменить оператор, нужно кликнуть по нему левой кнопкой мыши.
en: To change the operator, it is required to left-click on it.

source: Чтобы использовать этот узел для обращения к веб-сервисам Loginom, при публикации пакетов должна применятся настройка Использовать пространство имен Loginom Integrator.
en: In order to use this node to get access to the Loginom web services, Use Loginom Integrator namespace option must be used to publish packages.

source: Чтобы их подключить, нужно добавить еще один порт у обработчика, нажав кнопку Добавить еще один порт.
en: To connect them, it is required to add another port using the handler by clicking on Add another port button.

source: Чтобы компонент стал узлом его необходимо перенести на рабочее пространство с помощью мышки или контекстного меню.
en: To make the node from the component, it must be moved to the working space using the button or context menu.

source: Чтобы опубликовать пакет, в дереве навигации необходимо кликнуть на нужном пакете правой кнопкой мыши и в контекстном меню выбрать пункт Публикация пакетов….
en: To publish the package, it is required to click on the required package in the navigation tree using the right button, and select Publish packages… in the context menu.

source: Чтобы отключить серию, необходимо нажать по ней на легенде диаграммы.
en: To disable the series, it is required to press it on the chart legend.

source: Чтобы посмотреть свойства узла, необходимо его выделить и нажать на кнопку Показать/скрыть инспектор свойств на панели инструментов.
en: To view the node properties, it is required to select it and press Show/hide property inspector button on the toolbar.

source: Чтобы при работе со Сценарием информационная панель оставалась открытой, ее нужно закрепить нажатием на кнопку , нажатие на открепляет панель.
en: To keep the information panel opened when working with the Workflow, it must be locked by pressing button. Pressing will unlock the panel.

source: Чтобы применить шаблон необходимо нажать кнопку .
en: To apply the template, it is required to press button.

source: Чтобы принудительно сбросить все внесенные в производный узел изменения и сделать производный и базовый узлы идентичными, следует в контекстном меню производного узла выбрать пункт Восстановить исходную конфигурацию узла.
en: To cancel all changes introduced into the derived node forcibly and to make the derived and base nodes identical, it is required to select Restore the source node configuration item in the context menu of the derived node.

source: Чтобы сбросить параметры фильтрации или поиска нужно воспользоваться кнопкой Очистить
en: To reset the filter or search settings, it is required to use Clean button.

source: Чтобы сбросить фильтрацию, необходимо нажать кнопку .
en: To reset filtration, it is required to press button.

source: Чтобы скрыть поле, необходимо нажать кнопку Отображается рядом с нужным столбцом.
en: To hide the field, it is required to press Visible button near the required column.

source: Чтобы скрыть/отобразить все поля, необходимо нажать кнопку Скрыть все поля / Отобразить все поля.
en: To hide/display all fields, it is required to press Hide all fields / Display all fields button.

source: Чтобы сохранить внесенные изменения необходимо нажать кнопку Применить, если изменения настроек сохранять не требуется, то — Отменить.
en: To save introduced changes, it is required to press Apply button if it is not required to save changed settings, press Cancell button.

source: Чтобы эти объекты были доступны в других пакетах, для них должна быть задана область видимости «Открытый (доступен во всех пакетах)», которая задается параметром объекта «Модификатор доступа».
en: To make these objects available in other packages, "Public" visibility area must be set for them (available in all packages) which is set by the following object parameter: «Access modifier».

source: Чукотский а.
en: The Chukotka Autonomous

source: Шаблоны:
en: Templates:

source: Шаг 1.
en: Step 1.

source: Шаг 2).
en: Step 2).

source: Шаг 2.
en: Step 2.

source: Шаг 3.
en: Step 3.

source: Шаг 4.
en: Step 4.

source: Шаги задаются узлами из стандартных или Производных компонентов.
en: The steps are set by the nodes from the standard or Derived components.

source: Шаги построения
en: Model steps

source: Ширина линии — параметр задает толщину линии, возможное значение от 0 до 30.
en: Line width: the parameter enables to set the line width. Possible value varies from 0 to 30.

source: Ширина поля задаётся в пикселях.
en: The field width is set in pixels.

source: Ширина — пользователь может выбирать ширину интервала, а количество интервалов рассчитывается автоматически, как отношение разности верхней и нижней границ к заданной ширине.
en: Width: a user can select the bin width and count of bins is automatically calculated as ratio of upper and lower bounds difference and the set width.

source: Ширину и видимость можно задать для каждого столбца.
en: It is possible to set width and visibility for each column.

source: Широкое применение линейной регрессии обусловлено тем, что большое количество реальных процессов в науке, экономике и бизнесе можно описать линейными моделями.
en: Wide use of linear regression is explained by the fact that many real processes in science, economics and business can be described in terms of linear models.

source: Щелчком левой кнопки мыши по области Шаги построения можно выбрать отображение информации о выбранной модели (если установлен соответствующий флажок), а также коэффициенты регрессии
en: Clicking on the Model steps area with the left mouse button, it is possible to select display of the information on the selected model (if corresponding checkbox has been selected), and also regression coefficients.

source: Щелчком левой кнопки мыши по области Шаги построения можно выбрать отображение информации о выбранной модели (если установлен соответствующий флажок), а также коэффициенты регрессии.
en: Clicking on the Model steps area with the left mouse button, it is possible to select display of the information on the selected model (if corresponding checkbox has been selected), and also regression coefficients.

source: Экспоненциально сглаженное скользящее среднее, в отличие от простого скользящего среднего придает последним наблюдениям более значимый вес, чем предпоследним, и т.д.
en: An exponentially smoothed moving average, as opposed to a simple moving average, gives the latest observations a more significant weight than the penultimate one, etc.

source: Экспорт
en: Export

source: Экспорт в JPG.
en: Export to JPG.

source: Экспорт в PDF.
en: Export to PDF.

source: Экспорт в PNG.
en: Export to PNG.

source: Экспорт в SVG.
en: Export to SVG.

source: Экспорт как таковой при этом не производится.
en: In this case, export as such is not performed.

source: Экспорт полученных результатов.
en: Export of the received results.

source: Экстремумы.
en: Extremes.

source: Элемент может присутствовать только в одном списке.
en: The item can be only in one list.

source: Элемент1,
en: Element1.

source: Элемент2,
en: Element2.

source: ЭлементN - значения элементов списка
en: ElementN - values of the list items.

source: Элементы навигации:
en: Navigation elements:

source: Элементы перечисления:
en: Enumeration items:

source: Элементы транзакции
en: Transaction items

source: Эта кнопка всегда находится в крайней правой позиции на панели инструментов.
en: This button is always located in the far right position on the toolbar.

source: Эта область задается параметром объекта "Модификатор доступа".
en: This area is set by parameter of the "Access modifier" object.

source: Эта функция используется для узлов, основанных на обучении (Нейронные сети (Нейросеть (Регрессия) и Нейросеть (Классификация)), Кластеризация и т.п.).
en: This function is used for the nodes based on the training (Neural networks (Neural network (Regression) and Neural network (Clustering)), Clustering, etc.).

source: Эти действия, а также возможные способы реагирования порта на изменение структуры поступающих в порт данных задаются в настройках порта.
en: These actions and also possible methods of the port reaction to the structure change of the data supplied to the port are set in the port settings.

source: Эти же действия выполняют кнопки на панели быстрого доступа:
en: It is possible to perform the same actions using the quick access toolbar buttons:

source: Эти значения заменяются строкой Ошибочный БИК.
en: These values are replaced with Wrong BIC row.

source: Эти изменения будут применены к производным узлам:
en: These changes will be applied to the derived nodes:

source: Эти настройки используются драйвером OLE DB для подключения к необходимой базе данных.
en: These settings are used by the OLE DB driver to connect to the required database.

source: Эти настройки могут использоваться в качестве значений по умолчанию и их изменение может повлечь за собой изменение результатов обработки данных.
en: These settings can be used as the default values, and their change can cause change of the data processing results.

source: Эти поля можно отсортировать по количеству выбранных преобразований.
en: These fields can be sorted by the number of selected transformations.

source: Эти таблицы можно задать вручную в мастере настройки (внутренние) или подать на вход обработчика (внешние).
en: It is possible to set these tables manually in the wizard (internal) or send to the handler port (external).

source: Это служебные компоненты.
en: They are service components.

source: Это значение можно изменить: большое число классов приводит к уменьшению их веса, а малое — к уменьшению информационного индекса.
en: This value can be changed. The high count of classes causes decrease of their weight, whereas the low one brings about decrease of information value.

source: Это значит, что в случае успешного обучения Нейросеть способна выдать верный результат на основании данных, которые отсутствовали в обучающей выборке, а также на неполных и/или «зашумленных», частично искажённых данных.
en: It means that on condition of the successful training, the Neural Network can return the correct result based on the data that was absent in the training sample, and also incomplete and/or "noisy", partially distorted data.

source: Это значит, что в случае успешного обучения сеть сможет вернуть верный результат на основании данных, которые отсутствовали в обучающей выборке, а также неполных и/или «зашумленных», частично искажённых данных.
en: It means that on condition of the successful training, the network can return the correct result based on the data that was absent in the training sample, and also incomplete and/or "noisy", partially distorted data.

source: Это количество задается параметром "Количество групп" .
en: This count is set by the "Group count" parameter.

source: Это может вызвать "перекос" в процессе обучения, и доминирующий класс будет рассматриваться как наиболее вероятный.
en: It can be considered as imbalance in the training process, and the dominating class will be considered as the most probable.

source: Это может повысить устойчивость алгоритма по отношению к начальным данным.
en: It can increase the algorithm stability relative to the source data.

source: Это можно сделать в меню Пакеты (см.
en: It can be done in the Package menu (refer to

source: Это можно сделать двумя способами:
en: It can be done in two ways:

source: Это можно сделать из контекстного меню дочернего узла, выбрав пункт Добавить соседний узел Добавить соседний узел, либо, выделив необходимый узел, нажать на кнопку Добавить соседний узел для создания соседнего узла.
en: It can be done using the contex menu of the child node. Select Add neighboring node Add neighboring node, or the required node, and press Add neighboring node button to create the neighboring node.

source: Это можно сделать нажав кнопку Связать автоматически.
en: It can be done using Auto link button.

source: Это можно сделать:
en: It can be done as follows:

source: Это необходимо в случаях, когда входные факторы коррелированы друг с другом, т.
en: It is required in the cases when the input factors are correlated with each other,

source: Это необходимо учитывать и при необходимости очищать кэш, доступный через объект require.cache:
en: It is required to take into account and clean out the cache available via require.cache object when required:

source: Это необходимо учитывать при построении запросов.
en: When formulating requests, it is required to take it into account.

source: Это нужно учитывать, если в данных имеются значения <null>, которые нужно заменить на другие значения, либо если необходимо заменить какие-либо значения на <null>.
en: It must be taken into account if <null> values to be replaced with other values are present in the data, or it is required to replace some values with <null>.

source: Это позволит передвигать диаграмму по экрану.
en: It will enable to move the chart on the screen.

source: Это позволяет более гибко реализовывать логику обработки данных.
en: It allows for more flexible implementation of the data processing logics.

source: Это поле получает Имя и Метку поля главной таблицы.
en: This field is given the Name and Caption of the main table field.

source: Это поля типа: целый, вещественный, дата/время.
en: The following field types are used: integer, real, date/time.

source: Это следует учитывать при изменении среды исполнения Сценариев (перемещение Сценариев на другие сервера, смене пользователя Windows и т.д.)
en: It is required to take this fact into account when changing the Workflows execution environment (transfer of the Workflows to other servers, switch of the Window user, etc.)

source: Этой настройкой можно воспользоваться в случае, если задача требует определенного числа кластеров, например, не больше 15.
en: This setting can be used if the definite number of cluster is required, for example, not exceeding 15.

source: Этот алгоритм зачастую дает хороший результат даже на небольших наборах данных.
en: This algorithm frequently produces good results even for small data sets.

source: Этот метод может привести к тому, что всего будет создано меньше интервалов.
en: This method can cause creation of less number of bins in total.

source: Этот метод можно применять и в случае, когда распределение данных отличается от нормального.
en: This method can be also used when data distribution differs from the normal one.

source: Этот механизм применяется для использования объектов и/или получения наборов данных из других пакетов.
en: This mechanism is required for use of objects and/or receipt of the data sets from other packages.

source: Этот параметр по умолчанию отключен.
en: This parameter is disabled by default.

source: Этот подраздел администрирования используется для управления общими папками и правами доступа к ним.
en: This administration subsection is used to control the shared folders and rights of access to them.

source: Этот процесс продолжается пока относительные изменения весов не станут меньше заданного порога или количество итераций не превысит заданной величины.
en: This process continues until the relative weights changes are less than the set threshold, or iteration count exceeds the set value.

source: Этот путь можно изменить в конфигурационных файлах сервера Loginom.
en: This path can be changed in the configuration files of the Loginom server.

source: Этот раздел в интерфейсе программы нужен для управления пользователями, рабочими папками и параметрами работы сервера.
en: This section is required in the application interface to control users, work folders and parameters of the server operation.

source: Этот файл защищает открытый пакет от возможности редактировать или удалить его другими пользователями.
en: This file protects the opened package from possible editing or deleting by other users.

source: Этот функционал доступен только при состоянии "Вход активирован".
en: This functionality is available only for "Input activated" state.

source: Эту таблицу можно выбрать из списка существующих в базе данных.
en: This table can be selected from the list of the database tables.

source: Яблоки
en: Apples

source: Является значением логического типа, по умолчанию включено.
en: It is a boolean value, enabled by default.

source: Является значением логического типа, по умолчанию выключено.
en: It is a boolean value, disabled by default.
